CF/Catalogs/СоответствиеВидовОплатыСККМOffline.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>СоответствиеВидовОплатыСККМOffline</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЭлектроннойОплатыПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОплатЧекаККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоответствиеВидовОплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодВидаОплатыККМOffline</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОплаты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОплатЧекаККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CF/Enums/ТипыОплатЧекаККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипыОплатЧекаККМ</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскийКредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бонусы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачетАванса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРассрочку</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/Catalogs/СоответствиеВидовОплатыСККМOffline/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьВсеВидыОплаты(Команда)
	
	Если Объект.СоответствиеВидовОплаты.Количество() > 0 Тогда
		
		ОповещенияПриЗавершении = Новый ОписаниеОповещения("ОбработатьОтветПользователя", ЭтотОбъект);
		
		ТекстВопроса = НСтр("ru='В табличной части ""Соответствие видов оплаты"" уже содержатся строки.
							|Очистить табличную часть перед заполнением?'");
		
		ПоказатьВопрос(ОповещенияПриЗавершении, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		ДобавитьВсеВидыОплатыНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКодыВидовОплатыККМOfflineИдентификаторами(Команда)
	
	ЗаполнитьКодыВидовОплатыККМOfflineИдентификаторамиНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьОтветПользователя(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.СоответствиеВидовОплаты.Очистить();
	КонецЕсли;
	
	ДобавитьВсеВидыОплатыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВсеВидыОплатыНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
		|	ВидыОплатЧекаККМ.Ссылка КАК ВидОплаты
		|ИЗ
		|	Справочник.ВидыОплатЧекаККМ КАК ВидыОплатЧекаККМ
		|ГДЕ
		|	ВидыОплатЧекаККМ.ТипОплаты В (ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.Наличные),
		|ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.ПлатежнаяКарта),
		|ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.БанковскийКредит))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Объект.СоответствиеВидовОплаты.Добавить();
		
		НоваяСтрока.ВидОплаты = Выборка.ВидОплаты;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКодыВидовОплатыККМOfflineИдентификаторамиНаСервере()
	
	Для Каждого ТекСтрока Из Элементы.СоответствиеВидовОплаты.ВыделенныеСтроки Цикл
		
		ДанныеТекущейСтроки = Объект.СоответствиеВидовОплаты.НайтиПоИдентификатору(ТекСтрока);
		
		ДанныеТекущейСтроки.КодВидаОплатыККМOffline = ДанныеТекущейСтроки.ВидОплаты.УникальныйИдентификатор();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
